/*


		06 10
		C언어 수업내용

		8장 함수

		────────────────────


		1. 함수

			ㅇ 순서에 관계없이 매번 main() 부터 실행됨
			ㅇ C언어에서는 모듈 == 함수로 이해
			ㅇ 특정 작업을 수행하는 독립적인 부분
			

			ㅇ 모듈의 장점

				1) 각 모듈들의 독자적인 개발 가능
				2) 다른 모듈과 독립적으로 변경 가능
				3) 유지 보수가 쉬워짐
				4) 모듈의 재사용 가능


			ㅇ 함수 정의

				반환형 함수명 ( 매개변수1, 매개변수2 ... )
									ㄴ 상수 X, 변수-배열-포인터 O
				{
					문장1;
					문장2;

					[ return 반환값; ] // 반환할 값이 없는 경우, 반환형이 void.
				}


			ㅇ 함수 원형

				함수가 있다는 것을 컴파일러에게 미리 알림
				반환형 함수명 ( 매개변수1, 매개변수2 );


			ㅇ 호출
			
				함수명 ( 인수, ( = 인자, argument, 실매개변수 ))
									ㄴ 상수 O, 변수 O

		
			ㅇ 사용자 정의 함수
			ㅇ 라이브러리 함수
				 ㄴ 표준입출력, 난수처리, 문자열처리, 시간처리, 수학연산, 오류처리, 데이터 검색, 정렬


		
		- one time P/W



*/